print(1 < 2)                        #менше
print(2.0 >= 1)                     #більше або рівно
print(2.0 == 2.0)                   #значення рівності
print(2.0 != 2.0)                   #значення нерівності

X = 2
Y = 4
Z = 6

print(X < Y < Z)                    #зчіплене порівняння: перевірка входження в діапазон
print(X < Y and Y < Z)
print(X < Y > Z)
print(1 < 2 < 3.0 < 4)
print(1 > 2 > 3.0 > 4)
print(1 == 2 < 3)

print(1.1 + 2.2 == 3.3)             #мало б бути true?
print(1.1 + 2.2)                    #близько до 3.3 але не точно: обмежена точність
print(int(1.1 + 2.2) == int(3.3))   #все вірно у випадку перетворення